podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FMC_MKE14D7.svd.xml
               <register>
                  <name>S2U</name>
                  <description>Cache Data Storage (upper word)</description>
                  <addressOffset>0x10</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S2L</name>
                  <description>Cache Data Storage (lower word)</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3U</name>
                  <description>Cache Data Storage (upper word)</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S3L</name>
                  <description>Cache Data Storage (lower word)</description>
                  <addressOffset>0x1C</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
